# Tratativa e mesclagem dos dados

### Importando bibliotecas e verificando as versões

In [9]:
import pandas as pd

In [10]:
print(f'''Verificando as versões das bibliotecas:\n
pandas:{pd.__version__}
''')

Verificando as versões das bibliotecas:

pandas:1.5.3

# Coleta de dados

In [21]:
# Estados

estados = pd.read_csv('..\data\estados_brasileiros.csv', sep= ';', encoding= 'latin-1')

In [22]:
# Idade dos Clientes

idade = pd.read_csv('..\data\idade_clientes.csv', sep= ';')

In [23]:
# Clientes da Operadora de Saúde

clientes = pd.read_excel('..\data\clientes_operadora_saude.xlsx')

## Analisando os dados

### Estados

In [24]:
estados.head()

   cod_estado    estado sigla_estado    pais
0           1      Acre           AC  Brasil
1           2   Alagoas           AL  Brasil
2           3     Amapa           AP  Brasil
3           4  Amazonas           AM  Brasil
4           5     Bahia           BA  Brasil

In [25]:
estados.describe()

       cod_estado
count   27.000000
mean    14.000000
std      7.937254
min      1.000000
25%      7.500000
50%     14.000000
75%     20.500000
max     27.000000

In [26]:
estados.isna().sum()

cod_estado      0
estado          0
sigla_estado    0
pais            0
dtype: int64

In [27]:
estados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cod_estado    27 non-null     int64
 1   estado        27 non-null     object
 2   sigla_estado  27 non-null     object
 3   pais          27 non-null     object
dtypes: int64(1), object(3)
memory usage: 992.0+ bytes

In [28]:
estados.shape

(27, 4)

### Clientes

In [29]:
clientes.head()

   id_cliente   peso  colesterol     genero  id_estado
0           1  102.0         111  Masculino         23
1           2  115.0         135  Masculino          7
2           3  115.0         136  Masculino          4
3           4  140.0         167   Feminino         24
4           5  130.0         158  Masculino         26

In [30]:
clientes.describe()

       id_cliente        peso  colesterol   id_estado
count  225.000000  222.000000  225.000000  225.000000
mean   113.000000  142.315315  168.733333   13.711111
std     65.096083   31.198817   39.413671    7.562307
min      1.000000   95.000000  102.000000    1.000000
25%     57.000000  115.000000  135.000000    7.000000
50%    113.000000  138.500000  168.000000   14.000000
75%    169.000000  170.000000  204.000000   20.000000
max    225.000000  203.000000  235.000000   27.000000

In [31]:
clientes.isna().sum()

id_cliente    0
peso          3
colesterol    0
genero        0
id_estado     0
dtype: int64

In [32]:
clientes.shape

(225, 5)

In [33]:
clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225 entries, 0 to 224
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_cliente  225 non-null    int64
 1   peso        222 non-null    float64
 2   colesterol  225 non-null    int64
 3   genero      225 non-null    object
 4   id_estado   225 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 8.9+ KB

### Idade

In [34]:
idade.head()

   id_cliente  idade
0           1     17
1           2     28
2           3     62
3           4     55
4           5     44

In [35]:
idade.describe()

       id_cliente       idade
count   547.00000  547.000000
mean    274.00000   42.791590
std     158.04957   15.160209
min       1.00000   16.000000
25%     137.50000   30.000000
50%     274.00000   42.000000
75%     410.50000   55.000000
max     547.00000   70.000000

In [36]:
idade.isna().sum()

id_cliente    0
idade         0
dtype: int64

In [37]:
idade.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 547 entries, 0 to 546
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_cliente  547 non-null    int64
 1   idade       547 non-null    int64
dtypes: int64(2)
memory usage: 8.7 KB

In [38]:
idade.shape

(547, 2)

### Visualizando os dados ausentes

In [39]:
clientes.loc[clientes['peso'].isnull()]

    id_cliente  peso  colesterol     genero  id_estado
32          33   NaN         188  Masculino         22
41          42   NaN         177  Masculino         20
87          88   NaN         168   Feminino         12

## Tratamento dos dados

### Dados ausentes numéricos

#### Descobrindo os dados ausentes

In [40]:
clientes.isna().sum()

id_cliente    0
peso          3
colesterol    0
genero        0
id_estado     0
dtype: int64

In [41]:
estados.isna().sum()

cod_estado      0
estado          0
sigla_estado    0
pais            0
dtype: int64

In [42]:
idade.isna().sum()

id_cliente    0
idade         0
dtype: int64

#### Eliminando dados

In [43]:
# Eliminando o dado
clientes.dropna(subset=['peso'], inplace= False)

     id_cliente   peso  colesterol     genero  id_estado
0             1  102.0         111  Masculino         23
1             2  115.0         135  Masculino          7
2             3  115.0         136  Masculino          4
3             4  140.0         167   Feminino         24
4             5  130.0         158  Masculino         26
..          ...    ...         ...        ...        ...
220         221  180.0         219  Masculino         20
221         222  116.0         138   Feminino         15
222         223  144.0         169   Feminino         18
223         224  102.0         116  Masculino          6
224         225  176.0         212  Masculino          7

[222 rows x 5 columns]

In [44]:
clientes.count()

id_cliente    225
peso          222
colesterol    225
genero        225
id_estado     225
dtype: int64

#### Corrigindo dados ausentes (média/mediana)

In [45]:
# Média e Mediana

media = clientes.peso.mean()
mediana = clientes.peso.median()

In [46]:
# Corrigir dados por média

clientes.describe()

       id_cliente        peso  colesterol   id_estado
count  225.000000  222.000000  225.000000  225.000000
mean   113.000000  142.315315  168.733333   13.711111
std     65.096083   31.198817   39.413671    7.562307
min      1.000000   95.000000  102.000000    1.000000
25%     57.000000  115.000000  135.000000    7.000000
50%    113.000000  138.500000  168.000000   14.000000
75%    169.000000  170.000000  204.000000   20.000000
max    225.000000  203.000000  235.000000   27.000000

In [47]:
clientes.peso.fillna(round(media,2), inplace=True)

### Dados ausentes para variável categórica

#### Descobrindo dados ausentes

In [48]:
estados.isna().sum()

cod_estado      0
estado          0
sigla_estado    0
pais            0
dtype: int64

In [49]:
# Contando valores contidos em "pais"
estados.pais.value_counts()

Brasil    27
Name: pais, dtype: int64

#### Corrigindo dados categóricos

In [50]:
# Descobrindo a moda de "país"
estados.pais.mode()

0    Brasil
Name: pais, dtype: object

In [51]:
# Criando variável com a ccorreção dos termos em "país"
correcao_pais = estados.pais.mode()[0]

In [52]:
estados.pais.fillna(correcao_pais, inplace= True)

In [53]:
estados.isna().sum()

cod_estado      0
estado          0
sigla_estado    0
pais            0
dtype: int64

#### Realizando junções dos datasets

In [54]:
# Merge = juntar duas tabelas

clientes_estados = pd.merge(clientes, estados, right_on = 'cod_estado', left_on = 'id_estado')
clientes_estados.sort_values('id_estado')

,id_cliente,peso,colesterol,genero,id_estado,cod_estado,estado,sigla_estado,pais
201,203,145.0,173,Feminino,1,1,Acre,AC,Brasil
199,104,118.0,140,Feminino,1,1,Acre,AC,Brasil
198,98,149.0,185,Feminino,1,1,Acre,AC,Brasil
197,38,96.0,105,Masculino,1,1,Acre,AC,Brasil
200,113,122.0,145,Masculino,1,1,Acre,AC,Brasil
...,...,...,...,...,...,...,...,...,...
107,44,193.0,224,Feminino,27,27,Tocantins,TO,Brasil
109,89,124.0,148,Feminino,27,27,Tocantins,TO,Brasil
110,134,156.0,195,Feminino,27,27,Tocantins,TO,Brasil
111,152,200.0,233,Masculino,27,27,Tocantins,TO,Brasil
108,80,123.0,147,Feminino,27,27,Tocantins,TO,Brasil

In [55]:
clientes_info = pd.merge(clientes_estados, idade, on= 'id_cliente').sort_values('id_cliente')

In [56]:
clientes_info[:10]

,id_cliente,peso,colesterol,genero,id_estado,cod_estado,estado,sigla_estado,pais,idade
0,1,102.0,111,Masculino,23,23,Roraima,RR,Brasil,17
9,2,115.0,135,Masculino,7,7,Distrito Federal,DF,Brasil,28
21,3,115.0,136,Masculino,4,4,Amazonas,AM,Brasil,62
32,4,140.0,167,Feminino,24,24,Santa Catarina,SC,Brasil,55
39,5,130.0,158,Masculino,26,26,Sergipe,SE,Brasil,44
47,6,198.0,227,Masculino,8,8,Espirito Santo,ES,Brasil,17
40,7,114.0,131,Masculino,26,26,Sergipe,SE,Brasil,30
56,8,145.0,176,Feminino,25,25,Sao Paulo,SP,Brasil,30
61,9,191.0,223,Feminino,16,16,Parana,PR,Brasil,34
66,10,186.0,221,Masculino,6,6,Ceara,CE,Brasil,55

In [57]:
# Resetando o index do dataframe

clientes_info.reset_index(drop=True)

,id_cliente,peso,colesterol,genero,id_estado,cod_estado,estado,sigla_estado,pais,idade
0,1,102.0,111,Masculino,23,23,Roraima,RR,Brasil,17
1,2,115.0,135,Masculino,7,7,Distrito Federal,DF,Brasil,28
2,3,115.0,136,Masculino,4,4,Amazonas,AM,Brasil,62
3,4,140.0,167,Feminino,24,24,Santa Catarina,SC,Brasil,55
4,5,130.0,158,Masculino,26,26,Sergipe,SE,Brasil,44
...,...,...,...,...,...,...,...,...,...,...
220,221,180.0,219,Masculino,20,20,Rio Grande do Norte,RN,Brasil,33
221,222,116.0,138,Feminino,15,15,Paraiba,PB,Brasil,38
222,223,144.0,169,Feminino,18,18,Piaui,PI,Brasil,24
223,224,102.0,116,Masculino,6,6,Ceara,CE,Brasil,31
224,225,176.0,212,Masculino,7,7,Distrito Federal,DF,Brasil,57

In [61]:
clientes_info.to_csv('merged_operadora_saude.csv')